package NIX.excemple_2;
//Hello world
//Создайте класс, который выводит на экран надпись "Hello world"
//Класс создан, запускается из консоли, при этом выводит "Hello world" на экран


public class Solution {
    public static void main(String[] args) {
        System.out.println("Hello world");
    }
}
